//
//  Constant.swift
//  WhosSpy
//
//  Created by Jim Chuang on 2018/4/17.
//  Copyright © 2018年 jj. All rights reserved.
//

import Foundation

let PREF_VILL_NUMBERS = "pref_vill_numbers"


func desceiption(index:Int) -> String{
    return "請給第 \(index) 個人觀看"
}

func showA(index:Int,ans:String) -> String{
    return "第 \(index) 個人的答案是[\(ans)]"
}


let totalA:[Array<String>] = [
    ["書桌","抽屜"],
    ["抽屜","書櫃"],
    ["書櫃","抽屜"],
    ["書桌","椅子"],
    ["椅子","桌子"],
    ["化妝桌","鏡子"],
    ["餐桌","桌巾"],
    ["書桌","書櫃"],
    ["書桌","餐桌"],
    ["書桌","梳妝桌"],
    ["瓜子","花生"],
    ["花生","瓜子"],
    ["瓜子","堅果"],
    ["洋芋片","瓜子"],
    ["陽春麵","泡麵"],
    ["陽春麵","烏龍麵"],
    ["香腸","熱狗"],
    ["熱狗","香腸"],
    ["雞排","牛排"],
    ["牛排","雞排"],
    ["醬油","鹽巴"],
    ["醬油","沙拉油"],
    ["醬油","豬油"],
    ["醬油","味精"],
    ["圍巾","手套"],
    ["圍巾","項鍊"],
    ["墾丁","沖繩"],
    ["澎湖","綠島"],
    ["海邊","游泳池"],
    ["浴缸","游泳池"],
    ["火鍋","圍爐"],
    ["火鍋","燒烤"],
    ["燒烤","火鍋"],
    ["醜小鴨","灰姑娘"],
    ["85度C","星巴克"],
    ["星巴克","85度C"],
    ["廁所","廚餘"],
    ["廚餘","廁所"],
    ["電視","電影"],
    ["電池","充電線"],
    ["電燈","檯燈"],
    ["冷氣","電風扇"],
    ["電風扇","冷氣"],
    ["刷牙","剔牙"],
    ["刷牙","漱口"],
    ["頭髮","腿毛"],
    ["眼淚","鼻涕"],
    ["老鼠","蟑螂"],
    ["濕紙巾","抹布"],
    ["雜誌","報紙"],
    ["撲克牌","麻將"],
    ["馬桶","小便斗"],
    ["量角器","圓規"],
    ["刷卡","借錢"],
    ["放假","下班"],
    ["下班","放假"],
    ["悠遊卡","信用卡"]
]

